VHEMaster/AutoECUv2/AutoECUv2.ioc
PA7.GPIOParameters=GPIO_Label,PinAttribute
PA7.GPIO_Label=OUTS1_IN10
PA7.Locked=true
PA7.PinAttribute=CortexM7
PA7.Signal=S_TIM14_CH1
PA9.GPIOParameters=GPIO_ModeDefaultPP,GPIO_Speed,GPIO_PuPd,PinAttribute
PA9.GPIO_ModeDefaultPP=GPIO_MODE_AF_PP
PA9.GPIO_PuPd=GPIO_PULLUP
PA9.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PA9.Locked=true
PA9.Mode=Asynchronous
PA9.PinAttribute=CortexM4
PA9.Signal=USART1_TX
PB0.GPIOParameters=GPIO_Label,PinAttribute
PB0.GPIO_Label=OUTS2_CH3
PB0.Locked=true
PB0.PinAttribute=CortexM7
PB0.Signal=S_TIM3_CH3
PB1.GPIOParameters=GPIO_Label,PinAttribute
PB1.GPIO_Label=OUTS2_CH4
PB1.Locked=true
PB1.PinAttribute=CortexM7
PB1.Signal=S_TIM3_CH4
PB10.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PB10.GPIO_PuPd=GPIO_PULLUP
PB10.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PB10.Locked=true
PB10.Mode=Enable Chip Select for each bank
PB10.PinAttribute=CortexM7
PB10.Signal=QUADSPI_BK1_NCS
PB11.GPIOParameters=GPIO_Label,PinAttribute
PB11.GPIO_Label=MOTOR1_DIS
PB11.Locked=true
PB11.PinAttribute=Free
PB11.Signal=GPIO_Output
PB12.GPIOParameters=GPIO_Label,PinAttribute
PB12.GPIO_Label=MOTOR2_DIS
PB12.Locked=true
PB12.PinAttribute=Free
PB12.Signal=GPIO_Output
PB13.GPIOParameters=PinAttribute
PB13.Locked=true
PB13.Mode=Full_Duplex_Master
PB13.PinAttribute=CortexM7
PB13.Signal=SPI2_SCK
PB14.GPIOParameters=GPIO_Label,PinAttribute
PB14.GPIO_Label=FLEXIO1_VRSO
PB14.Locked=true
PB14.PinAttribute=CortexM7
PB14.Signal=S_TIM12_CH1
PB15.GPIOParameters=GPIO_Label,PinAttribute
PB15.GPIO_Label=FLEXIO2_VRSO
PB15.Locked=true
PB15.PinAttribute=CortexM7
PB15.Signal=S_TIM12_CH2
PB2.GPIOParameters=GPIO_Label,PinAttribute
PB2.GPIO_Label=IGN_NEN
PB2.Locked=true
PB2.PinAttribute=Free
PB2.Signal=GPIO_Output
PB3\ (JTDO/TRACESWO).GPIOParameters=PinAttribute
PB3\ (JTDO/TRACESWO).Locked=true
PB3\ (JTDO/TRACESWO).Mode=Trace_Asynchronous_SW
PB3\ (JTDO/TRACESWO).PinAttribute=CortexM7
PB3\ (JTDO/TRACESWO).Signal=DEBUG_JTDO-SWO
PB4\ (NJTRST).GPIOParameters=PinAttribute
PB4\ (NJTRST).Locked=true
PB4\ (NJTRST).Mode=Full_Duplex_Master
PB4\ (NJTRST).PinAttribute=CortexM7
PB4\ (NJTRST).Signal=SPI3_MISO
PB5.GPIOParameters=PinAttribute
PB5.Locked=true
PB5.Mode=Full_Duplex_Master
PB5.PinAttribute=CortexM7
PB5.Signal=SPI3_MOSI
PB6.GPIOParameters=GPIO_Label,PinAttribute
PB6.GPIO_Label=SPI3_NSS_FLEXIO2
PB6.Locked=true
PB6.PinAttribute=Free
PB6.Signal=GPIO_Output
PB7.GPIOParameters=GPIO_Label,PinAttribute
PB7.GPIO_Label=SPI6_NSS_KNOCK
PB7.Locked=true
PB7.PinAttribute=Free
PB7.Signal=GPIO_Output
PB8.GPIOParameters=GPIO_Label,PinAttribute
PB8.GPIO_Label=OUTS1_IN11
PB8.PinAttribute=CortexM7
PB8.Signal=S_TIM16_CH1
PB9.GPIOParameters=GPIO_Label,PinAttribute
PB9.GPIO_Label=OUTS1_IN12
PB9.PinAttribute=CortexM7
PB9.Signal=S_TIM17_CH1
PC0.GPIOParameters=GPIO_Label,PinAttribute
PC0.GPIO_Label=FLEXIO1_AOX
PC0.Locked=true
PC0.PinAttribute=CortexM7
PC0.Signal=ADCx_INP10
PC1.GPIOParameters=GPIO_Label,PinAttribute
PC1.GPIO_Label=FLEXIO2_AOX
PC1.Locked=true
PC1.PinAttribute=CortexM7
PC1.Signal=ADCx_INP11
PC10.GPIOParameters=PinAttribute
PC10.Locked=true
PC10.Mode=Full_Duplex_Master
PC10.PinAttribute=CortexM7
PC10.Signal=SPI3_SCK
PC11.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PC11.GPIO_PuPd=GPIO_PULLUP
PC11.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PC11.Locked=true
PC11.Mode=Enable Chip Select for each bank
PC11.PinAttribute=CortexM7
PC11.Signal=QUADSPI_BK2_NCS
PC12.GPIOParameters=GPIO_Label,PinAttribute
PC12.GPIO_Label=STEP_ERR
PC12.Locked=true
PC12.PinAttribute=Free
PC12.Signal=GPIO_Input
PC13.GPIOParameters=GPIO_Label,PinAttribute
PC13.GPIO_Label=LOGIC_OE
PC13.Locked=true
PC13.PinAttribute=Free
PC13.Signal=GPIO_Output
PC14-OSC32_IN\ (OSC32_IN).GPIOParameters=PinAttribute
PC14-OSC32_IN\ (OSC32_IN).Mode=LSE-External-Oscillator
PC14-OSC32_IN\ (OSC32_IN).PinAttribute=Free
PC14-OSC32_IN\ (OSC32_IN).Signal=RCC_OSC32_IN
PC15-OSC32_OUT\ (OSC32_OUT).GPIOParameters=PinAttribute
PC15-OSC32_OUT\ (OSC32_OUT).Mode=LSE-External-Oscillator
PC15-OSC32_OUT\ (OSC32_OUT).PinAttribute=Free
PC15-OSC32_OUT\ (OSC32_OUT).Signal=RCC_OSC32_OUT
PC2_C.GPIOParameters=PinAttribute
PC2_C.Locked=true
PC2_C.Mode=Full_Duplex_Master
PC2_C.PinAttribute=CortexM7
PC2_C.Signal=SPI2_MISO
PC3_C.GPIOParameters=PinAttribute
PC3_C.Locked=true
PC3_C.Mode=Full_Duplex_Master
PC3_C.PinAttribute=CortexM7
PC3_C.Signal=SPI2_MOSI
PC4.GPIOParameters=GPIO_Label,PinAttribute
PC4.GPIO_Label=SPI6_NSS_EGT1
PC4.Locked=true
PC4.PinAttribute=Free
PC4.Signal=GPIO_Output
PC5.GPIOParameters=GPIO_Label,PinAttribute
PC5.GPIO_Label=SPI6_NSS_EGT2
PC5.Locked=true
PC5.PinAttribute=Free
PC5.Signal=GPIO_Output
PC6.GPIOParameters=GPIO_Label,PinAttribute
PC6.GPIO_Label=OUTS2_CH1
PC6.Locked=true
PC6.PinAttribute=CortexM7
PC6.Signal=S_TIM3_CH1
PC7.GPIOParameters=GPIO_Label,PinAttribute
PC7.GPIO_Label=OUTS2_CH2
PC7.Locked=true
PC7.PinAttribute=CortexM7
PC7.Signal=S_TIM3_CH2
PC8.GPIOParameters=GPIO_Label,PinAttribute
PC8.GPIO_Label=MOTOR2_PWM
PC8.Locked=true
PC8.PinAttribute=CortexM7
PC8.Signal=S_TIM8_CH3
PC9.GPIOParameters=GPIO_Label,PinAttribute
PC9.GPIO_Label=MOTOR1_PWM
PC9.Locked=true
PC9.PinAttribute=CortexM7
PC9.Signal=S_TIM8_CH4
PD0.GPIOParameters=GPIO_Speed,PinAttribute
PD0.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PD0.Locked=true
PD0.Mode=FDCAN_Activate
PD0.PinAttribute=CortexM4
PD0.Signal=FDCAN1_RX
PD1.GPIOParameters=GPIO_Speed,PinAttribute
PD1.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PD1.Locked=true
PD1.Mode=FDCAN_Activate
PD1.PinAttribute=CortexM4
PD1.Signal=FDCAN1_TX
PD10.GPIOParameters=GPIO_Label,PinAttribute
PD10.GPIO_Label=USART3_LO
PD10.Locked=true
PD10.PinAttribute=Free
PD10.Signal=GPIO_Input
PD12.GPIOParameters=GPIO_Label,PinAttribute
PD12.GPIO_Label=OUTS2_CH9
PD12.Locked=true
PD12.PinAttribute=CortexM7
PD12.Signal=S_TIM4_CH1
PD13.GPIOParameters=GPIO_Label,PinAttribute
PD13.GPIO_Label=OUTS2_CH10
PD13.Locked=true
PD13.PinAttribute=CortexM7
PD13.Signal=S_TIM4_CH2
PD14.GPIOParameters=GPIO_Label,PinAttribute
PD14.GPIO_Label=OUTS2_CH11
PD14.Locked=true
PD14.PinAttribute=CortexM7
PD14.Signal=S_TIM4_CH3
PD15.GPIOParameters=GPIO_Label,PinAttribute
PD15.GPIO_Label=OUTS2_CH12
PD15.Locked=true
PD15.PinAttribute=CortexM7
PD15.Signal=S_TIM4_CH4
PD2.ContextOwner=CortexM7
PD2.GPIOParameters=GPIO_Label,PinAttribute
PD2.GPIO_Label=FDCAN1_LBK
PD2.Locked=true
PD2.PinAttribute=CortexM7
PD2.Signal=GPIO_Output
PD3.GPIOParameters=GPIO_Label,PinAttribute
PD3.GPIO_Label=STEP_I0
PD3.Locked=true
PD3.PinAttribute=Free
PD3.Signal=GPIO_Output
PD4.GPIOParameters=GPIO_Label,PinAttribute
PD4.GPIO_Label=STEP_I1
PD4.Locked=true
PD4.PinAttribute=Free
PD4.Signal=GPIO_Output
PD5.GPIOParameters=GPIO_Label,PinAttribute
PD5.GPIO_Label=STEP_PH1
PD5.Locked=true
PD5.PinAttribute=Free
PD5.Signal=GPIO_Output
PD6.GPIOParameters=GPIO_Label,PinAttribute
PD6.GPIO_Label=STEP_PH2
PD6.Locked=true
PD6.PinAttribute=Free
PD6.Signal=GPIO_Output
PD7.GPIOParameters=GPIO_Label,PinAttribute
PD7.GPIO_Label=SPI2_NSS_FLEXIO1
PD7.Locked=true
PD7.PinAttribute=Free
PD7.Signal=GPIO_Output
PD8.GPIOParameters=PinAttribute
PD8.Locked=true
PD8.Mode=Asynchronous
PD8.PinAttribute=CortexM7
PD8.Signal=USART3_TX
PD9.GPIOParameters=PinAttribute
PD9.Locked=true
PD9.Mode=Asynchronous
PD9.PinAttribute=CortexM7
PD9.Signal=USART3_RX
PE0.GPIOParameters=GPIO_Label,PinAttribute
PE0.GPIO_Label=FLEXIO1_SYNC
PE0.Locked=true
PE0.PinAttribute=Free
PE0.Signal=GPXTI0
PE1.GPIOParameters=GPIO_Label,PinAttribute
PE1.GPIO_Label=FLEXIO2_SYNC
PE1.Locked=true
PE1.PinAttribute=Free
PE1.Signal=GPIO_Output
PE10.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PE10.GPIO_PuPd=GPIO_PULLUP
PE10.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE10.Locked=true
PE10.Mode=Dual_Bank
PE10.PinAttribute=CortexM7
PE10.Signal=QUADSPI_BK2_IO3
PE11.GPIOParameters=GPIO_Label,PinAttribute
PE11.GPIO_Label=OUTS1_CH2
PE11.Locked=true
PE11.PinAttribute=CortexM7
PE11.Signal=S_TIM1_CH2
PE12.GPIOParameters=GPIO_Label,PinAttribute
PE12.GPIO_Label=FLEXIO1_INT
PE12.Locked=true
PE12.PinAttribute=Free
PE12.Signal=GPXTI12
PE13.GPIOParameters=GPIO_Label,PinAttribute
PE13.GPIO_Label=FLEXIO2_INT
PE13.Locked=true
PE13.PinAttribute=Free
PE13.Signal=GPXTI13
PE14.GPIOParameters=GPIO_Label,PinAttribute
PE14.GPIO_Label=OUTS1_CH4
PE14.Locked=true
PE14.PinAttribute=CortexM7
PE14.Signal=S_TIM1_CH4
PE5.GPIOParameters=GPIO_Label,PinAttribute
PE5.GPIO_Label=LAMBDA1_HEATER
PE5.Locked=true
PE5.PinAttribute=CortexM7
PE5.Signal=S_TIM15_CH1
PE6.GPIOParameters=GPIO_Label,PinAttribute
PE6.GPIO_Label=LAMBDA2_HEATER
PE6.Locked=true
PE6.PinAttribute=CortexM7
PE6.Signal=S_TIM15_CH2
PE7.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PE7.GPIO_PuPd=GPIO_PULLUP
PE7.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE7.Locked=true
PE7.Mode=Dual_Bank
PE7.PinAttribute=CortexM7
PE7.Signal=QUADSPI_BK2_IO0
PE8.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PE8.GPIO_PuPd=GPIO_PULLUP
PE8.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE8.Locked=true
PE8.Mode=Dual_Bank
PE8.PinAttribute=CortexM7
PE8.Signal=QUADSPI_BK2_IO1
PE9.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PE9.GPIO_PuPd=GPIO_PULLUP
PE9.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE9.Locked=true
PE9.Mode=Dual_Bank
PE9.PinAttribute=CortexM7
PE9.Signal=QUADSPI_BK2_IO2
PF0.GPIOParameters=GPIO_Label,PinAttribute
PF0.GPIO_Label=IGN_CH5
PF0.Locked=true
PF0.PinAttribute=Free
PF0.Signal=GPIO_Output
PF1.GPIOParameters=GPIO_Label,PinAttribute
PF1.GPIO_Label=IGN_CH6
PF1.Locked=true
PF1.PinAttribute=Free
PF1.Signal=GPIO_Output
PF10.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PF10.GPIO_PuPd=GPIO_PULLUP
PF10.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF10.Locked=true
PF10.Mode=Dual_Bank
PF10.PinAttribute=CortexM7
PF10.Signal=QUADSPI_CLK
PF11.GPIOParameters=PinAttribute
PF11.Locked=true
PF11.Mode=Full_Duplex_Master
PF11.PinAttribute=CortexM7
PF11.Signal=SPI5_MOSI
PF12.GPIOParameters=GPIO_Label,PinAttribute
PF12.GPIO_Label=IGN_CH1
PF12.Locked=true
PF12.PinAttribute=Free
PF12.Signal=GPIO_Output
PF13.GPIOParameters=GPIO_Label,PinAttribute
PF13.GPIO_Label=IGN_CH2
PF13.Locked=true
PF13.PinAttribute=Free
PF13.Signal=GPIO_Output
PF14.GPIOParameters=GPIO_Label,PinAttribute
PF14.GPIO_Label=IGN_CH3
PF14.Locked=true
PF14.PinAttribute=Free
PF14.Signal=GPIO_Output
PF15.GPIOParameters=GPIO_Label,PinAttribute
PF15.GPIO_Label=IGN_CH4
PF15.Locked=true
PF15.PinAttribute=Free
PF15.Signal=GPIO_Output
PF2.GPIOParameters=GPIO_Label,PinAttribute
PF2.GPIO_Label=IGN_CH7
PF2.Locked=true
PF2.PinAttribute=Free
PF2.Signal=GPIO_Output
PF3.GPIOParameters=GPIO_Label,PinAttribute
PF3.GPIO_Label=IGN_CH8
PF3.Locked=true
PF3.PinAttribute=Free
PF3.Signal=GPIO_Output
PF4.GPIOParameters=GPIO_Label,PinAttribute
PF4.GPIO_Label=MOTOR1_DIR
PF4.Locked=true
PF4.PinAttribute=Free
PF4.Signal=GPIO_Output
PF5.GPIOParameters=GPIO_Label,PinAttribute
PF5.GPIO_Label=MOTOR2_DIR
PF5.Locked=true
PF5.PinAttribute=Free
PF5.Signal=GPIO_Output
PF6.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PF6.GPIO_PuPd=GPIO_PULLUP
PF6.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF6.Locked=true
PF6.Mode=Dual_Bank
PF6.PinAttribute=CortexM7
PF6.Signal=QUADSPI_BK1_IO3
PF7.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PF7.GPIO_PuPd=GPIO_PULLUP
PF7.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF7.Locked=true
PF7.Mode=Dual_Bank
PF7.PinAttribute=CortexM7
PF7.Signal=QUADSPI_BK1_IO2
PF8.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PF8.GPIO_PuPd=GPIO_PULLUP
PF8.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF8.Locked=true
PF8.Mode=Dual_Bank
PF8.PinAttribute=CortexM7
PF8.Signal=QUADSPI_BK1_IO0
PF9.GPIOParameters=GPIO_Speed,GPIO_PuPd,PinAttribute
PF9.GPIO_PuPd=GPIO_PULLUP
PF9.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF9.Locked=true
PF9.Mode=Dual_Bank
PF9.PinAttribute=CortexM7
PF9.Signal=QUADSPI_BK1_IO1
PG0.GPIOParameters=GPIO_Label,PinAttribute
PG0.GPIO_Label=SPI5_NSS_OUTSM1
PG0.Locked=true
PG0.PinAttribute=Free
PG0.Signal=GPIO_Output
PG1.GPIOParameters=GPIO_Label,PinAttribute
PG1.GPIO_Label=SPI5_NSS_OUTSM2
PG1.Locked=true
PG1.PinAttribute=Free
PG1.Signal=GPIO_Output
PG10.GPIOParameters=GPIO_Label,PinAttribute
PG10.GPIO_Label=SPI6_NSS_LAMBDA1
PG10.Locked=true
PG10.PinAttribute=Free
PG10.Signal=GPIO_Output
PG11.GPIOParameters=GPIO_Label
PG11.GPIO_Label=OUTS_RESET
PG11.Locked=true
PG11.Signal=GPIO_Output
PG12.GPIOParameters=PinAttribute
PG12.Locked=true
PG12.Mode=Full_Duplex_Master
PG12.PinAttribute=CortexM7
PG12.Signal=SPI6_MISO
PG13.GPIOParameters=PinAttribute
PG13.Locked=true
PG13.Mode=Full_Duplex_Master
PG13.PinAttribute=CortexM7
PG13.Signal=SPI6_SCK
PG14.GPIOParameters=PinAttribute
PG14.Locked=true
PG14.Mode=Full_Duplex_Master
PG14.PinAttribute=CortexM7
PG14.Signal=SPI6_MOSI
PG15.GPIOParameters=GPIO_Label,PinAttribute
PG15.GPIO_Label=SPI6_NSS_LAMBDA2
PG15.Locked=true
PG15.PinAttribute=Free
PG15.Signal=GPIO_Output
PG2.GPIOParameters=GPIO_Label,PinAttribute
PG2.GPIO_Label=SPI5_NSS_OUTS1
PG2.Locked=true
PG2.PinAttribute=Free
PG2.Signal=GPIO_Output
PG3.GPIOParameters=GPIO_Label,PinAttribute
PG3.GPIO_Label=SPI5_NSS_OUTS2
PG3.Locked=true
PG3.PinAttribute=Free
PG3.Signal=GPIO_Output
PG4.GPIOParameters=GPIO_Label,PinAttribute
PG4.GPIO_Label=FLEXIO2_SENT1
PG4.Locked=true
PG4.PinAttribute=Free
PG4.Signal=GPXTI4
PG5.GPIOParameters=GPIO_Label,PinAttribute
PG5.GPIO_Label=FLEXIO2_SENT2
PG5.Locked=true
PG5.PinAttribute=Free
PG5.Signal=GPXTI5
PG6.GPIOParameters=GPIO_Label,PinAttribute
PG6.GPIO_Label=FLEXIO2_SENT3
PG6.Locked=true
PG6.PinAttribute=Free
PG6.Signal=GPXTI6
PG7.GPIOParameters=GPIO_Label,PinAttribute
PG7.GPIO_Label=FLEXIO2_SENT4
PG7.Locked=true
PG7.PinAttribute=Free
PG7.Signal=GPXTI7
PG8.GPIOParameters=GPIO_Label,PinAttribute
PG8.GPIO_Label=LAMBDA_NRST
PG8.Locked=true
PG8.PinAttribute=Free
PG8.Signal=GPIO_Output
PH0-OSC_IN\ (PH0).GPIOParameters=PinAttribute
PH0-OSC_IN\ (PH0).Mode=HSE-External-Oscillator
PH0-OSC_IN\ (PH0).PinAttribute=Free
PH0-OSC_IN\ (PH0).Signal=RCC_OSC_IN
PH1-OSC_OUT\ (PH1).GPIOParameters=PinAttribute
PH1-OSC_OUT\ (PH1).Mode=HSE-External-Oscillator
PH1-OSC_OUT\ (PH1).PinAttribute=Free
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
PJ10.GPIOParameters=GPIO_Label,PinAttribute
PJ10.GPIO_Label=FLEXIO2_WAKE
PJ10.Locked=true
PJ10.PinAttribute=Free
PJ10.Signal=GPXTI10
PJ11.GPIOParameters=PinAttribute
PJ11.Locked=true
PJ11.Mode=Full_Duplex_Master
PJ11.PinAttribute=CortexM7
PJ11.Signal=SPI5_MISO
PJ8.GPIOParameters=GPIO_Label,PinAttribute
PJ8.GPIO_Label=FLEXIO1_WAKE
PJ8.Locked=true
PJ8.PinAttribute=Free
PJ8.Signal=GPIO_Output
PJ9.GPIOParameters=GPIO_Label,PinAttribute
PJ9.GPIO_Label=OUTS1_CH3
PJ9.Locked=true
PJ9.PinAttribute=CortexM7
PJ9.Signal=S_TIM1_CH3
PK0.GPIOParameters=PinAttribute
PK0.Locked=true
PK0.Mode=Full_Duplex_Master
PK0.PinAttribute=CortexM7
PK0.Signal=SPI5_SCK
PK1.GPIOParameters=GPIO_Label,PinAttribute
PK1.GPIO_Label=OUTS1_CH1
PK1.Locked=true
PK1.PinAttribute=CortexM7
PK1.Signal=S_TIM1_CH1
PK2.GPIOParameters=GPIO_Label,PinAttribute
PK2.GPIO_Label=KNOCK_INT
PK2.Locked=true
PK2.PinAttribute=Free
PK2.Signal=GPIO_Output
PinOutPanel.RotationAngle=0
ProjectManager.AskForMigrate=true
ProjectManager.BackupPrevious=false
ProjectManager.BootMode=boot0
ProjectManager.CompilerOptimize=6
ProjectManager.ComputerToolchain=false
ProjectManager.CoupleFile=false
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DefaultFWLocation=true
ProjectManager.DeletePrevious=true
ProjectManager.DeviceId=STM32H745IITx
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.11.1
ProjectManager.FreePins=false
ProjectManager.HalAssertFull=false
ProjectManager.HeapSize=M4-0x2000,M7-0x2000
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Core/Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=STM32CubeIDE
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=AutoECUv2.ioc
ProjectManager.ProjectName=AutoECUv2
ProjectManager.ProjectStructure=M7\:Non Secure Project\:true;M4\:Non Secure Project\:true;
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=M4-0x4000,M7-0x4000
ProjectManager.TargetToolchain=STM32CubeIDE
ProjectManager.ToolChainLocation=
ProjectManager.UnderRoot=true
ProjectManager.functionlistsort=1-SystemClock_Config-RCC-false-HAL-false-CortexM7,2-MX_GPIO_Init-GPIO-false-HAL-true-CortexM7,3-MX_DMA_Init-DMA-false-HAL-true-CortexM7,4-MX_MDMA_Init-MDMA-false-HAL-true-CortexM7,5-MX_SPI2_Init-SPI2-false-HAL-true-CortexM7,6-MX_SPI3_Init-SPI3-false-HAL-true-CortexM7,7-MX_QUADSPI_Init-QUADSPI-false-HAL-true-CortexM7,8-MX_SPI6_Init-SPI6-false-HAL-true-CortexM7,9-MX_RTC_Init-RTC-false-HAL-true-CortexM7,10-MX_IWDG1_Init-IWDG1-false-HAL-true-CortexM7,11-MX_TIM15_Init-TIM15-false-HAL-true-CortexM7,12-MX_USART3_UART_Init-USART3-false-HAL-true-CortexM7,13-MX_ADC1_Init-ADC1-false-HAL-true-CortexM7,14-MX_TIM1_Init-TIM1-false-HAL-true-CortexM7,15-MX_TIM16_Init-TIM16-false-HAL-true-CortexM7,16-MX_TIM17_Init-TIM17-false-HAL-true-CortexM7,17-MX_DAC1_Init-DAC1-false-HAL-true-CortexM7,18-MX_SPI5_Init-SPI5-false-HAL-true-CortexM7,19-MX_TIM2_Init-TIM2-false-HAL-true-CortexM7,20-MX_TIM3_Init-TIM3-false-HAL-true-CortexM7,21-MX_TIM4_Init-TIM4-false-HAL-true-CortexM7,22-MX_TIM5_Init-TIM5-false-HAL-true-CortexM7,23-MX_TIM8_Init-TIM8-false-HAL-true-CortexM7,24-MX_TIM12_Init-TIM12-false-HAL-true-CortexM7,25-MX_TIM13_Init-TIM13-false-HAL-true-CortexM7,26-MX_TIM14_Init-TIM14-false-HAL-true-CortexM7,1-MX_GPIO_Init-GPIO-false-HAL-true-CortexM4,2-MX_DMA_Init-DMA-false-HAL-true-CortexM4,3-MX_MDMA_Init-MDMA-false-HAL-true-CortexM4,4-MX_USART1_UART_Init-USART1-false-HAL-true-CortexM4,5-MX_USB_OTG_FS_PCD_Init-USB_OTG_FS-false-HAL-true-CortexM4,6-MX_FDCAN1_Init-FDCAN1-false-HAL-true-CortexM4,7-MX_RTC_Init-RTC-true-HAL-false-CortexM4,8-MX_IWDG2_Init-IWDG2-false-HAL-true-CortexM4,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true-CortexM7,0-MX_VREFBUF_Init-VREFBUF-false-HAL-true-CortexM7,0-MX_CORTEX_M4_Init-CORTEX_M4-false-HAL-true-CortexM4,0-MX_VREFBUF_Init-VREFBUF-true-HAL-false-CortexM4
QUADSPI.ClockPrescaler=3-1
QUADSPI.IPParameters=ClockPrescaler
RCC.ADCFreq_Value=80000000
RCC.AHB12Freq_Value=240000000
RCC.AHB4Freq_Value=240000000
RCC.APB1Freq_Value=120000000
RCC.APB2Freq_Value=120000000
RCC.APB3Freq_Value=120000000
RCC.APB4Freq_Value=120000000
RCC.AXIClockFreq_Value=240000000
